In [69]:
pip install pandas

Requirement already satisfied: pandas in ./.venv/lib/python3.13/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.26.0 in ./.venv/lib/python3.13/site-packages (from pandas) (2.4.0)
Requirement already satisfied: python-dateutil>=2.8.2 in ./.venv/lib/python3.13/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in ./.venv/lib/python3.13/site-packages (from pandas) (2025.3)
Requirement already satisfied: six>=1.5 in ./.venv/lib/python3.13/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [70]:
#dataframe만드는 방법
import pandas as pd

df = pd.DataFrame()
df['Name'] = ["Jacky","Steven","George"]
df['Age'] = [23, 34, 29]
df['driver'] = [True, False, True]

df

     Name  Age  driver
0   Jacky   23    True
1  Steven   34   False
2  George   29    True

In [71]:
#ptyhon dictionary로 dataframe 만드는 방법
data = {
    'Name': ["Jacky","Steven","George"],
    'Age': [23, 34, 29],
    'driver': [True, False, True]
}

df = pd.DataFrame(data)
df

     Name  Age  driver
0   Jacky   23    True
1  Steven   34   False
2  George   29    True

In [72]:
#각 series는 index를 포함하고 있음
df['Name']

0     Jacky
1    Steven
2    George
Name: Name, dtype: object

In [73]:
print(type(df))
print(type(df['Name']))  # pandas Series

<class 'pandas.core.frame.DataFrame'>
<class 'pandas.core.series.Series'>

In [74]:
#dataframe index에 접근하기
df.index

RangeIndex(start=0, stop=3, step=1)

In [75]:
#index 이름 설정하기
df.index.name = 'index'

In [76]:
df

         Name  Age  driver
index
0       Jacky   23    True
1      Steven   34   False
2      George   29    True

In [77]:
#index 재설정
#원래 있었던 index는 새로운 column으로 들어오고, 새로운 index열이 생김
df.reset_index()

   index    Name  Age  driver
0      0   Jacky   23    True
1      1  Steven   34   False
2      2  George   29    True

In [78]:
data = {
    "Name" : ["Jacky","Steven","George"],
    "Age" : [23,34,29],
    "driver" : [True, False, True]
}
df = pd.DataFrame(data)
df.index = ["a","b","c"]
df.index.name = "index"

df

         Name  Age  driver
index
a       Jacky   23    True
b      Steven   34   False
c      George   29    True

In [79]:
#새로운 column data 추가하기
df["LOCATION"] = ["USA", "UK", "Canada"]
df

         Name  Age  driver LOCATION
index
a       Jacky   23    True      USA
b      Steven   34   False       UK
c      George   29    True   Canada

In [80]:
#column 이름 변경하기
df = df.rename(columns={"Name":"Person"})
df

       Person  Age  driver LOCATION
index
a       Jacky   23    True      USA
b      Steven   34   False       UK
c      George   29    True   Canada

In [81]:
#column 삭제하기
df.drop(columns="LOCATION", inplace=True)
df

       Person  Age  driver
index
a       Jacky   23    True
b      Steven   34   False
c      George   29    True

In [82]:
#새로운 row를 dataframe형태로 만들기
data = {
    "Person" : ["Harry"],
    "Age" : [25],
    "driver" : [False]
}

new_df = pd.DataFrame(data, index=["d"])
new_df

  Person  Age  driver
d  Harry   25   False

In [83]:
#새로운 데이터를 dataframe형태로 만들기
df = pd.concat([df, new_df])
df

   Person  Age  driver
a   Jacky   23    True
b  Steven   34   False
c  George   29    True
d   Harry   25   False

In [84]:
data = {
    "Name" : ["Jacky","Steven","George","Harry"],
    "Age" : [23,34,29,105],
    "driver" : [True, False, True, False]
}
df = pd.DataFrame(data)
df.index = ["a","b","c","d"]
df.index.name = "index"

df

         Name  Age  driver
index
a       Jacky   23    True
b      Steven   34   False
c      George   29    True
d       Harry  105   False

In [85]:
#대괄호 인덱싱 [] 
    # - 특정 열을 선택할 때 사용 
    # - 슬라이싱을 사용하여 행을 선택할 수 있음 예 df[1:5]

#1 특정 열 선택하기
df['Name']

index
a     Jacky
b    Steven
c    George
d     Harry
Name: Name, dtype: object

In [86]:
#여러개의 열
df[['Name','Age']]

         Name  Age
index
a       Jacky   23
b      Steven   34
c      George   29
d       Harry  105

In [87]:
#2 여러 행 데이터 선택
df[0:2]

         Name  Age  driver
index
a       Jacky   23    True
b      Steven   34   False

In [88]:
#.lock[]인덱서를 사용해서 index가 'a'인 행 접근하기
df.loc['a']

Name      Jacky
Age          23
driver     True
Name: a, dtype: object

In [90]:
#.loc을 사용하여 indexrk 'a'인 행에서 'Name'열에 접근하기
df.loc['a','Name']

'Jacky'

In [91]:
#.iloc[] 인덱서를 사용해서 위치기반 인덱싱 하기
    # - 행과 열의 위치(정수 인덱스)를 사용하여 데이터
df

         Name  Age  driver
index
a       Jacky   23    True
b      Steven   34   False
c      George   29    True
d       Harry  105   False

In [92]:
#,iloc 를 사용하여 두 번째 행에 접근하기
df.iloc[1]

Name      Steven
Age           34
driver     False
Name: b, dtype: object

In [ ]:
#.iloc을 사용하여 2번째 행, 1번째 열에 접근하기
print(df.iloc[1,1])
print(df.iloc[2,0])

np.int64(34)

In [96]:
#불리언 인덱싱
#조건에 맞는 행 선택하기
# df[df['Age'] > 30]
df

         Name  Age  driver
index
a       Jacky   23    True
b      Steven   34   False
c      George   29    True
d       Harry  105   False

In [99]:
#4 boolean 인덱싱은 데이터를 필터링 할 때 많이 사용됨
df['Age'] > 25

index
a    False
b     True
c     True
d     True
Name: Age, dtype: bool

In [100]:
df[df['Age'] > 25]

         Name  Age  driver
index
b      Steven   34   False
c      George   29    True
d       Harry  105   False

In [101]:
#.at[] ,.iat[] 인덱서를 사용하여 스칼라 값에 접근하기
    # - .at[] : 라벨 기반 인덱싱
    # - .iat[] : 위치 기반 인덱싱

df

         Name  Age  driver
index
a       Jacky   23    True
b      Steven   34   False
c      George   29    True
d       Harry  105   False

In [106]:
#at을 사용하여 index 'a'의 'Name'열에 접근하기
df.at['a','driver']

np.True_

In [105]:
#.iloc[] 인덱서를 사용해서 위치기반 인덱싱 하기
df.iat[0,2]

np.True_

In [ ]:
#pandas로 data 읽고 쓰기